app/controllers/admins/genres_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "is_active" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["is_active", 0], ["updated_at", "2020-08-04 01:08:45.113981"], ["id", 1]]
---
  def update
    @genre = Genre.find(params[:id])
    @genre.update(genre_params)

INSERT INTO "genres" ("name", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "プリン"], ["is_active", 1], ["created_at", "2020-08-03 06:53:43.689221"], ["updated_at", "2020-08-03 06:53:43.689221"]]
---
  def create
    @newgenre = Genre.new(genre_params)
    if @newgenre.save