app/controllers/admins/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "is_sale_status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "7ff449570f44be302b414ad5d003add38db0cee18cfe37265749ec41d0af"], ["is_sale_status", 0], ["updated_at", "2020-08-08 23:04:11.264341"], ["id", 1]]
---
  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)

INSERT INTO "items" ("genre_id", "description", "name", "price", "image_id", "is_sale_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    item = Item.new(item_params)
    if item.save

SELECT "genres".* FROM "genres"
---
  def new
    @item = Item.new
    @genres = Genre.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
---
  def edit
    @item = Item.find(params[:id])
    @genres = Genre.all