app/controllers/admins/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
  def show
    @order = Order.find(params[:id])
    @order_items = @order.order_items