app/controllers/customers/customers_controller.rb

  def update
    @customer = Customer.find(params[:id])
    if @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "last_name" = ?, "first_name" = ?, "last_name_kana" = ?, "first_name_kana" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["last_name", "テスト"], ["first_name", "太朗"], ["last_name_kana", "テスト"], ["first_name_kana", "タロウ"], ["updated_at", "2020-07-28 16:05:21.078584"], ["id", 1]]