app/views/ships/index.html.erb

    <tbody>
      <% current_customer.ships.each do |ship| %>
---
SELECT "ships".* FROM "ships" WHERE "ships"."customer_id" = ?  [["customer_id", 1]]