app/controllers/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
  def index
    @cart_items = current_customer.cart_items.all

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 1], ["item_id", 2], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 1], ["item_id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "item_quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["item_quantity", 2], ["updated_at", "2020-08-13 06:51:21.175753"], ["id", 1]]
INSERT INTO "cart_items" ("customer_id", "item_id", "item_quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 1], ["item_id", 2], ["item_quantity", 1], ["created_at", "2020-08-13 06:44:29.008360"], ["updated_at", "2020-08-13 06:44:29.008360"]]
---
  def create
    @cart_item = CartItem.new(cart_item_params)
    @cart_item.customer_id = current_customer.id
    if current_customer.cart_items.where(item_id: @cart_item.item_id).exists?
      # 個数を合算する
      @cart_item = current_customer.cart_items.find_by(item_id: @cart_item.item_id)
      # （カラムを指定　現在のアイテムの量　＋　送られてきたパラメータの値）
      @cart_item.update(item_quantity: @cart_item.item_quantity + params[:cart_item][:item_quantity].to_i)
    else
      @cart_item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "item_quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["item_quantity", 1], ["updated_at", "2020-08-13 06:51:28.781892"], ["id", 1]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(cart_item_params)