app/controllers/orders_controller.rb

  def new
    @order_new = Order.new
    @ship = Ship.where(customer_id: current_customer.id)
    @my_cart = current_customer.cart_items
    if @my_cart.empty?
---
SELECT "ships".* FROM "ships" WHERE "ships"."customer_id" = ?  [["customer_id", 1]]
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."customer_id" = ? LIMIT ?  [["customer_id", 1], ["LIMIT", 1]]

  def create
    @order_new = Order.new(order_params)
    @cart_items = CartItem.where(customer_id: current_customer.id)
    # カートへ戻る
      if params[:back].present?
            render 'cart_items/index'
        return
    # 情報入力へ戻る
      elsif params[:info].present?
              @ship = Ship.where(customer_id: current_customer.id)
            render 'orders/new'
        return
      end
      if @order_new.save
        @cart_items.each do |f|
          @order_item_new = OrderItem.new
          @order_item_new.order_id = @order_new.id
          @order_item_new.item_id = f.item.id
          @order_item_new.product_status = "製作待ち"
          @order_item_new.price = f.item.price
          @order_item_new.quantity = f.item_quantity
          @order_item_new.name = f.item.name
          @order_item_new.save
        end
          @ship_new = Ship.new(customer_id: current_customer.id, code: params[:order][:ship_postcode],address: params[:order][:ship_address],name: params[:order][:ship_name])
          @ship_new.save!
        current_customer.cart_items.destroy_all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
SELECT "ships".* FROM "ships" WHERE "ships"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "orders" ("customer_id", "freight", "total", "ship_name", "ship_postcode", "ship_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "order_items" ("item_id", "order_id", "product_status", "price", "quantity", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "ships" ("customer_id", "address", "name", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["address", "Osaka"], ["name", "テスト太朗"], ["code", "11111111"], ["created_at", "2020-08-22 15:33:48.374783"], ["updated_at", "2020-08-22 15:33:48.374783"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 13]]

  def show
    @order = Order.find(params[:id])
    @order_item = @order.order_items
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 9]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def confirm
    @freight = 800
    @cart_items = current_customer.cart_items.all
    @order_new = Order.new(order_params)
    @order_new.customer_id = current_customer.id
    @pay_method = params[:order][:pay_method]
    # 自分の配送先
    if params[:ship_num] == "1"
      @order_postcode = current_customer.post_code
      @order_address = current_customer.address
      @order_name = (current_customer.last_name) + (current_customer.first_name)
    # 登録済みの配送先
    elsif params[:ship_num] == "2"
      @order_postcode = Ship.find(params[:ship_id]).view_ship_code
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
SELECT  "ships".* FROM "ships" WHERE "ships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @orders = current_customer.orders.all
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]