app/controllers/ships_controller.rb

  def create
    @ship = Ship.new(ship_params)
    @ship.customer_id = current_customer.id
    if @ship.save
---
INSERT INTO "ships" ("customer_id", "address", "name", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["address", "大阪府大阪市"], ["name", "山田太朗"], ["code", "1234567"], ["created_at", "2020-08-18 08:56:59.930454"], ["updated_at", "2020-08-18 08:56:59.930454"]]

  def destroy
    ship = Ship.find(params[:id])
    ship.destroy
---
SELECT  "ships".* FROM "ships" WHERE "ships"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "ships" WHERE "ships"."id" = ?  [["id", 2]]