app/views/admins/orders/index.html.erb

				<td><%= link_to order.updated_at.strftime("%Y-%m-%d %H:%M"),admins_order_path(order.id) %></td>
				<td><%= order.customer.last_name+order.customer.first_name %></td>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

					<% @sum=0 %>
					<% order.order_items.each do |o| %>
---
SELECT "orders".* FROM "orders"
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]