app/views/admins/orders/show.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
                    <%= form_for order_item, url:admins_order_item_path(order_item.id) do |f| %>
                    <%= f.select :product_status, OrderItem.product_statuses.keys, {}  %>